"""
------------------------------------
@Version :   1.0
@Time    :   2024/02/05 12:48
@File    :   08_nested_if_example2.py
@Author  :   Saber 
------------------------------------
"""

# 出票系统：根据淡旺季的月份和年龄，打印票价
'''
4-10月 旺季:
    成人(18-60):60元
    儿童(<18):半价
    老人(>60):1/3
淡季：
    成人:40元
    其他:20元
'''

'''
    思路分析:
    1.定义变量month存储月份,判断是淡季还是旺季
    2.定义age变量来存储年龄信息
    3.使用if-else语句
    4.if 4 <= month <= 10属于旺季,进一步输出票价[嵌套一层判断年龄]
    5.else属于淡季,进一步输出票价[嵌套一层判断年龄]
'''
month = int(input("请输入当前月份(1-12):"))
age = int(input("请输入你的年龄:"))
if 4 <= month <= 10:
    if age >= 0:
        if 18 <= age <= 60:
            print("成人,票价60元")  
        elif age < 18:
            print("儿童,票价30元")
        else:
            print("老人,票价20元")
    else:
        print("年龄输入不合法!")
else:
    if age >= 0:
        if 18 <= age <= 60: 
            print("成人,票价40元")
        else:
            print("票价统一20元")