"""
------------------------------------
@Version :   1.0
@Time    :   2024/02/06 16:00
@File    :   15_while_exercise04.py
@Author  :   Saber 
------------------------------------
"""

# 打印1-100之间所有是9的倍数的整数，统计个数及总和
'''
    1. 定义i变量 + while循环 来打印1-100之间的数
    2. 利用条件:i % 9 == 0来筛选出符合9的倍数的数
    3. 定义sum变量,初始值设为0,每次找到一个符合条件的数,就计入sum中,即:sum += i
    4. 同时定义一个计数器count,每次找到一个符合条件的数,count就加1,即:count += 1
    5. 输出结果
'''
i = 1
sum = 0
count = 0
while (i <= 100):
    if (i % 9 == 0):
        count += 1
        sum += i
        print(i)
    i = i + 1
print(f"1-100之间9的倍数有{count}个,它们的总和为{sum}")