"""
------------------------------------
@Version :   1.0
@Time    :   2024/02/06 18:04
@File    :   21_mutiply_for_exercise01.py
@Author  :   Saber 
------------------------------------
"""

# 打印金字塔
# 编写一个程序,可以接收一个整数,表示层数(total_level),打印出空心金字塔
'''
实现思路:
化繁为简、先死后活:
*****        *                 *                *
*****        **               ***              * *
*****   =>   ***      =>     *****     =>     *   *
*****        ****           *******          *     *
*****        *****         *********        *********
-- 先死后活:
1. 先不考虑层数的变化,假定为5层(一个定值)
-- 化繁为简：
1. 打印矩形
    1) 定义j用来控制每行输出的"*"的个数
    2) 定义i用来控制输出"*****"的层数
    3) 用嵌套循环来实现
2. 打印直角三角形
    1) 在打印除矩形的基础上,
    第一层:1个*
    第二层:2个*
    第三层:3个*
    第四层:4个*
    第五层:5个*
    2) 当i < j时,就跳出内层循环,不打印多余的*
    3) 尝试去理解方法二
3. 打印金字塔
    1) 在打印直角三角形的基础上:
    第一层:1个*  2*1-1
    第二层:3个*  2*2-1
    第三层:5个*  2*3-1
    第四层:7个*  2*4-1
    第五层:9个*  2*5-1
    即:每层要输出"*"的个数是(2 * 第几层 - 1)个
    2) 之后直角三角形 => 金字塔
    第一层:1个*  2*1-1  4个空格  5-1
    第二层:3个*  2*2-1  3个空格  5-2
    第三层:5个*  2*3-1  2个空格  5-3
    第四层:7个*  2*4-1  1个空格  5-4
    第五层:9个*  2*5-1  0个空格  5-5
    即:每层要输出的" "的个数是(层数 - 第几层)个
4. 打印空心金字塔
    1) 在打印金字塔的基础上:
        1) 除最后一层外:只有每层的两边输出"*"
        2) 最后一层输出所有"*"
    2) 除了两边输出"*"外,两个"*"之间还需要输出空格
    3) 最后一层正常输出所有"*"
    
-- 先死后活:
2. 最后考虑层数的变量,将定值5改成需要用户输出的层数,定义一个变量total_level来存储
'''

# 打印矩形
# i用来控制输出"*****"的层数
for i in range(5):
    # j用来控制每行输出的"*"的个数
    for j in range(5):
        print("*", end = "")    # end = ""表示输出不换行
    print("\n")         # 每输出5个*就换一次行


# 打印直角三角形
# 实现方法一
# i用来控制输出"*****"的层数
for i in range(5):
    # j用来控制每行输出的"*"的个数
    for j in range(5):
        if i < j:
            break
        print("*", end = "")    # end = ""表示输出不换行
    print("\n")         # 每输出5个*就换一次行
#实现方法二
# i用来控制输出"*****"的层数
for i in range(1, 6):
    # j用来控制每行输出的"*"的个数
    for j in range(i):
        print("*", end = "")    # end = ""表示输出不换行
    print("\n")         # 每输出5个*就换一次行


# 打印金字塔
# i用来控制输出"*****"的层数
for i in range(1, 6):
    # k用来控制每行输出的" "(空格)的个数
    for k in range(5 - i):
        print(" ", end = "")
    # j用来控制每行输出的"*"的个数
    for j in range(2 * i - 1):
        print("*", end = "")    # end = ""表示输出不换行
    print("\n")         # 每输出5个*就换一次行


# 打印空心金字塔
# i用来控制输出"*****"的层数
for i in range(1, 6):
    # k用来控制每行输出的" "(空格)的个数
    for k in range(5 - i):
        print(" ", end = "")
    # j用来控制每行输出的"*"的个数
    for j in range(2 * i - 1):
        if j == 0 or j == 2 * i - 1 - 1 or i == 5:
            print("*", end = "")    # end = ""表示输出不换行
        else:
            print(" ", end = "")
    print("\n")         # 每输出5个*就换一次行


# 后活:
total_level = int(input("请输入你要打印的层数:"))
for i in range(1, total_level + 1):
    for k in range(total_level - i):
        print(" ", end = "")
    for j in range(2 * i - 1):
        if j == 0 or j == 2 * i - 1 - 1 or i == total_level:
            print("*", end = "")
        else:
            print(" ", end = "")
    print("\n")