"""
------------------------------------
@Version :   1.0
@Time    :   2024/02/08 14:31
@File    :   31_homework01.py
@Author  :   Saber 
------------------------------------
"""

'''
某人有100000元,每经过一次路口,需要缴费,规则如下:
当现金 > 50000时,每次交5%
当现金 <= 50000时,每次交1000
'''
'''
思路分析:
1) 定义变量money表示当前有多少钱
2) 当money < 1000时就不能通过路口了,这就是能否通过路口的临界条件
3) 利用while + break来实现,分三种情况:
    1) (5000, +∞)
    2) [1000, 5000]
    3) (0, 1000)
4) 定义变量pass_num来记录通过路口的次数
'''
money = 100000
pass_num = 0
while money:
    if money > 50000:
        money -= money * 0.05
    elif money >= 1000:
        money -= 1000
    else:
        break
    pass_num += 1
print(f"该人可以通过{pass_num}次路口,剩余的钱有{money}元")