"""
------------------------------------
@Version :   1.0
@Time    :   2024/02/03 22:11
@File    :   01_arithmetic_operator.py
@Author  :   Saber 
------------------------------------
"""

# / // % **

# 对于除号 /,返回结果是小数
print(10 / 3)   # 3.3333333333333335

# 对于取整除 //,返回商的整数部分(向下取整)
print(9 // 2)   # 4
print(-9 // 2)  # -5

# 当对一个数取模时,对应的运算公式是：a % b = a - a // b * b
print(10 % 3)   # 1
print(-10 % 3)  # 2     -10 - (-10) // 3 * 3 = -10 + 4 * 3 = -10 + 12 = 2
print(10 % -3)  # 10 - 10 // (-3) * (-3) = 10 - (-4) * (-3) = -2
print(-10 % -3) # -10 - (-10) // (-3) * (-3) = -10 - 3 * (-3) = -10 + 9 = -1

# 幂运算
print(2 ** 5)   # 32
print(9 ** 2)   # 81