"""
------------------------------------
@Version :   1.0
@Time    :   2024/02/11 23:05
@File    :   09_recursion_exercise03.py
@Author  :   Saber 
------------------------------------
"""

# 求函数值,已知f(1) = 3;f(n) = 2 * f(n - 1) + 1;请使用递归的编程思想,求出f(n)的值
'''
f(1) = 3
f(2) = 2 * f(1) + 1 = 2 * 3 + 1 = 7
f(3) = 2 * f(2) + 1 = 2 * 7 + 1 = 15
f(4) = 2 * f(3) + 1 = 2 * 15 + 1 = 31
f(5) = 2 * f(4) + 1 = 2 * 31 + 1 = 63
...
'''
def f(n):
    if n == 1:
        return 3
    else:
        return 2 * f(n - 1) + 1
print(f(5))