"""
------------------------------------
@Version :   1.0
@Time    :   2024/02/11 23:04
@File    :   08_recursion_exercise02.py
@Author  :   Saber 
------------------------------------
"""

# 猴子吃桃子问题:有一堆桃子,猴子第一天吃了其中的一半,并再多吃了一个!以后每天猴子都吃其中的一半,然后再多吃一个。当到第10天时,想再吃时(即：还没吃),发现只有一个桃子了。问题:最初共有多少个桃子?
'''
day = 10 => 1个桃子
day = 9 => 4个桃子
day = 8 => 10个桃子
day = 7 => 22个桃子
day = 6 => 46个桃子
day = 5 => 94个桃子
day = 4 => 190个桃子
day = 3 => 382个桃子
day = 2 => 766个桃子
day = 1 => 1534个桃子
'''
def peach(day):
    if day == 10:
        return 1
    else:
        return (peach(day + 1) + 1) * 2
print(peach(1))
# (1 + 1) * 2 = 4 => (4 + 1) * 2 = 10 => (10 + 1) * 2 = 22 => (22 + 1) * 2 = 46